Revit 2026 API

# ToposolidCreate(Document, IListCurveLoop, ElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Toposolid Create(
	Document document,
	IList<CurveLoop> profiles,
	ElementId topoTypeId,
	ElementId levelId
)
```
```vb
Public Shared Function Create (
	document As Document,
	profiles As IList(Of CurveLoop),
	topoTypeId As ElementId,
	levelId As ElementId
) As Toposolid
```
```cpp
public:
static Toposolid^ Create(
	Document^ document,
	IList<CurveLoop^>^ profiles,
	ElementId^ topoTypeId,
	ElementId^ levelId
)
```
```fsharp
static member Create :
        document : Document *
        profiles : IList<CurveLoop> *
        topoTypeId : ElementId *
        levelId : ElementId -> Toposolid
```

#### Parameters

document Document

profiles IListCurveLoop

topoTypeId ElementId

levelId ElementId

#### Return Value

Toposolid

#### Reference

Toposolid Class

Create Overload

Autodesk.Revit.DB Namespace